app/views/incidents/_form.html.erb

                                        <div class="col-lg-10">
                                          <% cates_array = Cate.all.map { |c| [c.cate_name, c.id] } %>
---
SELECT  `cates`.* FROM `cates`  ORDER BY `cates`.`id` DESC LIMIT 1