app/views/incidents/index.html.erb

SELECT COUNT(*) FROM `incidents` WHERE `incidents`.`status_id` = 1
---
        <button class="btn btn-primary" type="button">
          Total Reported Incidents:<span class="badge"><%= Incident.where(:status => 1).count%></span>