app/controllers/incidents_controller.rb

SELECT  `incidents`.* FROM `incidents`  ORDER BY id DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `incidents`
SELECT `cates`.* FROM `cates` WHERE `cates`.`id` IN (6, 1, 3, 2, 5)
---
  def index
    @incidents = @paginate = Incident.includes(:cate).order('id DESC').paginate(:page => params[:page], :per_page => 5)

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
SELECT  `departments`.* FROM `departments` WHERE `departments`.`id` = 3 LIMIT 1
---
  def update_group
    reporter = Person.find(params[:reporter_id])
    @reporter_id = reporter.id
    @group = reporter.group.group_name
    @department = reporter.group.department.department_name

SELECT  `incidents`.* FROM `incidents` WHERE `incidents`.`id` = 2 LIMIT 1
---
  def edit
    @incident = Incident.find(params[:id])

INSERT INTO `incidents` (`reporter_id`, `location`, `severity`, `cate_id`, `other_cate_description`, `incident_description`, `created_at`, `updated_at`) VALUES (2, 'Halligan', 3, 6, '', 'fell down', '2016-02-18 02:54:21', '2016-02-18 02:54:21')
---
  def create
    @incident = Incident.new(incident_params)
    respond_to do |format|
      if @incident.save

SELECT  `incidents`.* FROM `incidents` WHERE `incidents`.`id` = 7 LIMIT 1
---
  def update
    @incident = Incident.find(params[:id])

SELECT  `incidents`.* FROM `incidents` WHERE `incidents`.`id` = 6 LIMIT 1
---
    def set_incident
      @incident = Incident.find(params[:id])